Конфигурация/Catalogs/Доверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Доверенности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоверенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоверенностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доверитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПредоставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзыва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицоПо5511У</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицоПо5899У</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеЛюбыхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеДоговоровДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеУведомленийОВводеВыводе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеАктовПриемаПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеПростыхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеБухгалтерскихДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеОтчетности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаверениеКопийДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлениеДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОграничений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыПредоставленияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОграниченияПоВидамДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поверенные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поверенный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ФормыПредоставленияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыПредоставленияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оригинал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КопияНотариальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КопияЗавереннаяОрганизацией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КопияЗавереннаяЭП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МЧД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Доверенности/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект, ДанныеЗаполнения);
	ЭтотОбъект.Ответственный = РаботаСПользователями.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыСправочника(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Номер, ИдентификаторДоверенности");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Поверенные.Количество() = 1 И Не ЗначениеЗаполнено(ЭтотОбъект.Поверенные[0].Поверенный) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Поверенный' не заполнено", ЭтотОбъект,,, Отказ);
		
		РеквизитПоверенный = ПроверяемыеРеквизиты.Найти("Поверенные.Поверенный");
		Если РеквизитПоверенный <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(РеквизитПоверенный);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ВидДоверенности = Перечисления.ВидыДоверенностей.Входящая Тогда
		ПроверяемыеРеквизиты.Добавить("Доверитель");
		ПроверяемыеРеквизиты.Добавить("Номер");
	Иначе
		ПроверяемыеРеквизиты.Добавить("ОписаниеПолномочий");
		ПроверяемыеРеквизиты.Добавить("МестоПредоставления");
	КонецЕсли; 
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	РаботаСоСправочниками.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ПроверитьУникальностьИдентификатора(Отказ);
	
	Если ЭтотОбъект.ДатаРегистрации < ЭтотОбъект.Дата Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Дата регистрации не может быть раньше даты самой доверенности",
			ЭтотОбъект.Ссылка,
			,
			"Объект.ДатаРегистрации", 
			Отказ);
			
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ЭтотОбъект.Наименование = ПолучитьНаименованиеПоПолномочиям();
	Если ЭтотОбъект.ВидДоверенности = Перечисления.ВидыДоверенностей.Исходящая И Не ЗначениеЗаполнено(ЭтотОбъект.Номер) Тогда
		РаботаСДокументооборотом.ПриУстановкеНовогоНомера(ЭтотОбъект, Истина, "");
	ИначеЕсли ЭтотОбъект.ВидДоверенности = Перечисления.ВидыДоверенностей.Исходящая Тогда
		ЭтотОбъект.Номер = СокрЛП(ЭтотОбъект.Номер);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.ВидДоверенности = Перечисления.ВидыДоверенностей.Исходящая Тогда
		ПроверитьКорректностьНомераИсходящейДоверенности(Отказ);
	КонецЕсли;
КонецПроцедуры
 
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	Префикс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ПрефиксНумерации");
	Если ЭтотОбъект.ВидДоверенности = Перечисления.ВидыДоверенностей.Входящая Тогда
		Префикс = Префикс + "-В-";
	Иначе
		Префикс = Префикс + "-И-";
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьНаименованиеПоПолномочиям()

	Если ЭтотОбъект.ВидДоверенности = Перечисления.ВидыДоверенностей.Входящая Тогда
		
		ПолномочияНаПодпись = Новый Структура;
		ПолномочияНаПодпись.Вставить("ПодписаниеЛюбыхДокументов", "любых документов");
		ПолномочияНаПодпись.Вставить("ПодписаниеДоговоровДУ", "договоров ДУ и доп. соглашений");
		ПолномочияНаПодпись.Вставить("ПодписаниеУведомленийОВводеВыводе", "уведомлений о вводе/выводе");
		ПолномочияНаПодпись.Вставить("ПодписаниеАктовПриемаПередачи", "актов");
		ПолномочияНаПодпись.Вставить("ПодписаниеПростыхПисем", "простых писем");
		ПолномочияНаПодпись.Вставить("ПодписаниеБухгалтерскихДокументов", "бух. документов");
		ПолномочияНаПодпись.Вставить("ПодписаниеОтчетности", "отчетности");
		
		МассивПолномочий = Новый Массив;
		
		Для каждого КЗ Из ПолномочияНаПодпись Цикл
		
			Если ЭтотОбъект[КЗ.Ключ] Тогда
				МассивПолномочий.Добавить(КЗ.Значение);
			КонецЕсли; 
		
		КонецЦикла; 
		
		Если МассивПолномочий.Количество() > 0 Тогда
		    ПредставлениеПолномочий = "Подписание ";
		Иначе
			ПредставлениеПолномочий = "";		
		КонецЕсли; 
				
		Если ЭтотОбъект.ЗаверениеКопийДокументов Тогда
			МассивПолномочий.Добавить("Заверение копий документов");
		КонецЕсли; 
		
		Если ЭтотОбъект.ПредоставлениеДокументов Тогда
			МассивПолномочий.Добавить("Предоставление документов");
		КонецЕсли; 	
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ОписаниеПолномочий) Тогда
			МассивПолномочий.Добавить(ЭтотОбъект.ОписаниеПолномочий);
		КонецЕсли; 		
		
		Если МассивПолномочий.Количество() > 0 Тогда
			ПредставлениеПолномочий = ПредставлениеПолномочий + СтрСоединить(МассивПолномочий, "; ");
		КонецЕсли; 
		
	Иначе
		
		ПредставлениеПолномочий = ЭтотОбъект.ОписаниеПолномочий;
		
	КонецЕсли; 
	
	Если СтрДлина(ПредставлениеПолномочий) > 150 Тогда
	
		ПредставлениеПолномочий = Лев(ПредставлениеПолномочий, 147) + "...";
	
	КонецЕсли; 
	
	Возврат ПредставлениеПолномочий;

КонецФункции

Процедура ПроверитьКорректностьНомераИсходящейДоверенности(Отказ)

	Если ЗначениеЗаполнено(ЭтотОбъект.Номер) Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Доверенности.Номер КАК Номер
			|ИЗ
			|	Справочник.Доверенности КАК Доверенности
			|ГДЕ
			|	Доверенности.Организация = &Организация
			|	И Доверенности.Номер = &Номер
			|	И Доверенности.Дата МЕЖДУ &НачалоГода И &КонецГода
			|	И Доверенности.Ссылка <> &Ссылка
			|	И Доверенности.ВидДоверенности = Значение(Перечисление.ВидыДоверенностей.Исходящая)";

		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("КонецГода", КонецГода(ЭтотОбъект.Дата));
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Номер", СокрЛП(ЭтотОбъект.Номер));
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В системе уже существует доверенность с номером " + СокрЛП(ЭтотОбъект.Номер), ЭтотОбъект.Ссылка,,, Отказ);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить новый номер исходящей доверенности", ЭтотОбъект.Ссылка,,, Отказ);
	
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПроверитьУникальностьИдентификатора(Отказ)
	
	Если ЭтотОбъект.ФормаПредоставления = Перечисления.ФормыПредоставленияДокументов.МЧД
		И ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторДоверенности) Тогда
	
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Доверенности");
		ЭлементБлокировкиДанных.УстановитьЗначение("ИдентификаторДоверенности", ЭтотОбъект.ИдентификаторДоверенности);
		ЭлементБлокировкиДанных.УстановитьЗначение("Доверитель", ЭтотОбъект.Доверитель);
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
		
		БлокировкаДанных.Заблокировать();
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Доверенности.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Доверенности КАК Доверенности
			|ГДЕ
			|	Доверенности.Ссылка <> &Ссылка
			|	И Доверенности.ИдентификаторДоверенности = &ИдентификаторДоверенности
			|	И Доверенности.Доверитель = &Доверитель
			|	И Доверенности.Организация = &Организация
			|	И Доверенности.ФормаПредоставления = ЗНАЧЕНИЕ(Перечисление.ФормыПредоставленияДокументов.МЧД)";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ИдентификаторДоверенности", ЭтотОбъект.ИдентификаторДоверенности);
		Запрос.УстановитьПараметр("Доверитель", ЭтотОбъект.Доверитель);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ТекстСообщения = СтрШаблон("Доверенность с идентификатором %1 уже зарегистрирована", ЭтотОбъект.ИдентификаторДоверенности);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,, Отказ);
		
		КонецЕсли;		
	
	КонецЕсли;
	
КонецПроцедуры
